Revit 2024 API
ReinforcementAbbreviationTag Members
The ReinforcementAbbreviationTag type exposes the following members.
Constructors
Name | Description
ReinforcementAbbreviationTag
 Constructs a new ReinforcementAbbreviationTag.
Methods
Name | Description
Dispose
Releases all resources used by the ReinforcementAbbreviationTag
Equals
Determines whether the specified Object is equal to the current Object.
 (Inherited from Object.)
GetHashCode
Serves as a hash function for a particular type.
 (Inherited from Object.)
GetType
Gets the Type of the current instance.
 (Inherited from Object.)
ToString
Returns a string that represents the current object.
 (Inherited from Object.)
Properties
Name | Description
AbbreviationTag
 The abbreviation tag value.
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
TypeTag
 The abbreviation tag type.
See Also
ReinforcementAbbreviationTag Class
Autodesk.Revit.DB.Structure Namespace